{
  "<s>": 0,
  "</s>": 1,
  "<pad>": 2,
  "<unk>": 3,
  "<mask>": 4,
  "[C@H]1CC[C@H]2[C@@H]3": 5,
  "[C@@H]1[C@@H]2CC[C@]2": 6,
  "=[N+]([O-])c1ccc": 7,
  "[CH][CH][CH][CH]": 8,
  "=[N+]([O-])c1cc": 9,
  "[CH][CH][CH][C]": 10,
  "[C]1[CH][CH]": 11,
  "[CH][CH][CH]": 12,
  "C[C@@H]1C": 13,
  "/C=C/c1c": 14,
  "N/N=C/c1": 15,
  "c2ccccc2": 16,
  "c4ccccc4": 17,
  "c1ccccc1": 18,
  "c3ccccc3": 19,
  "COc1cccc": 20,
  "CCOc1ccc": 21,
  "N/N=C/c2": 22,
  "-c2ccccc": 23,
  "/C=C/c2c": 24,
  "\\C/C=C\\C": 25,
  "/N=C/c2c": 26,
  "/N=C/c1c": 27,
  "N#Cc1ccc": 28,
  "COc1ccc2": 29,
  "C[C@H]1C": 30,
  "COc1cc2c": 31,
  "CCCCCCCC": 32,
  "COc1cc2": 33,
  "Cc1ccc2": 34,
  "c3ccccc": 35,
  "/C=C/c1": 36,
  "Clc1ccc": 37,
  "Cc1cccc": 38,
  "c2ccccc": 39,
  "2ccccc2": 40,
  "1ccccc1": 41,
  "/C=C/c2": 42,
  "-c2cccc": 43,
  "c1ccccc": 44,
  "3ccccc3": 45,
  "N/N=C/c": 46,
  "4ccccc4": 47,
  "/C=N/NC": 48,
  "/N=C/c1": 49,
  "COc1ccc": 50,
  "CCc1ccc": 51,
  "Nc1ccc": 52,
  "ccccc1": 53,
  "CC1=CC": 54,
  "Fc1ccc": 55,
  "CCCCCC": 56,
  "Cc1ccc": 57,
  "Oc1ccc": 58,
  "CCN1CC": 59,
  "C=C1CC": 60,
  "/C=C/C": 61,
  "-c3ccc": 62,
  "c3cccc": 63,
  "-c2ccc": 64,
  "N/N=C/": 65,
  "1ccccc": 66,
  "2ccccc": 67,
  "ccccc2": 68,
  "c1cccc": 69,
  "/C=C/c": 70,
  "CC1CCC": 71,
  "Cc1cc2": 72,
  "c2cccc": 73,
  "O=C1CC": 74,
  "CCCCc1": 75,
  "/C=N/N": 76,
  "3ccccc": 77,
  "/N=C/c": 78,
  "ccccc3": 79,
  "CCCCO": 80,
  "cccc1": 81,
  "3cccc": 82,
  "COCCN": 83,
  "CCc1n": 84,
  "O=c1c": 85,
  "COCCO": 86,
  "1cccc": 87,
  "cccc2": 88,
  "-c3cc": 89,
  "C=CCN": 90,
  "ccccc": 91,
  "/C=C/": 92,
  "c2ccc": 93,
  "O=C1C": 94,
  "CC1CC": 95,
  "Cc1cc": 96,
  "CC1=C": 97,
  "CN1CC": 98,
  "/N=C/": 99,
  "-c2cc": 100,
  "2cccc": 101,
  "c3ccc": 102,
  "CCC1C": 103,
  "C=CCC": 104,
  "CCCCN": 105,
  "COCc1": 106,
  "C=CCO": 107,
  "CCCCC": 108,
  "CSc1n": 109,
  "CCn1c": 110,
  "CCCc1": 111,
  "C=C1C": 112,
  "Cn1cc": 113,
  "O=C1N": 114,
  "Cc1nc": 115,
  "Nc1nc": 116,
  "NCCC": 117,
  "C#CC": 118,
  "CC1C": 119,
  "CCCN": 120,
  "CCOC": 121,
  "CCn1": 122,
  "Cc1n": 123,
  "CCCO": 124,
  "CCC1": 125,
  "CCCC": 126,
  "O=c1": 127,
  "COCC": 128,
  "COC1": 129,
  "CNc1": 130,
  "Cc1o": 131,
  "c2cc": 132,
  "2ccc": 133,
  "cccc": 134,
  "CC1=": 135,
  "CSc1": 136,
  "Cn1c": 137,
  "Cn1n": 138,
  "CCc1": 139,
  "-c2c": 140,
  "3ccc": 141,
  "-c3c": 142,
  "c3cc": 143,
  "O=C1": 144,
  "N#CC": 145,
  "ccc2": 146,
  "1ccc": 147,
  "C=CC": 148,
  "cc3": 149,
  "2cc": 150,
  "1cc": 151,
  "-c2": 152,
  "c3c": 153,
  "cc1": 154,
  "cc2": 155,
  "CCN": 156,
  "CNC": 157,
  "Cn1": 158,
  "C=C": 159,
  "CC1": 160,
  "CCC": 161,
  "Nc1": 162,
  "Cc1": 163,
  "OCC": 164,
  "Oc1": 165,
  "NCC": 166,
  "CCO": 167,
  "COC": 168,
  "C#C": 169,
  "N#C": 170,
  "NC1": 171,
  "ccc": 172,
  "3cc": 173,
  "c2c": 174,
  "3c": 175,
  "=O": 176,
  "nc": 177,
  "NC": 178,
  "OC": 179,
  "C1": 180,
  "O=": 181,
  "CO": 182,
  "=C": 183,
  "CN": 184,
  "CC": 185,
  "c2": 186,
  "cc": 187,
  "C2": 188,
  "-c": 189,
  "2c": 190,
  "1c": 191,
  "1C": 192,
  "c3": 193,
  "F": 194,
  "O": 195,
  "N": 196,
  "C": 197,
  "=": 198,
  "n": 199,
  "1": 200,
  "2": 201,
  "3": 202,
  "4": 203,
  "(": 204,
  ")": 205,
  "c": 206,
  "I": 207,
  "Cl": 208,
  "-": 209,
  "o": 210,
  "[nH]": 211,
  "#": 212,
  "[N+]": 213,
  "s": 214,
  "S": 215,
  "Sc": 216,
  "Br": 217,
  "5": 218,
  "6": 219,
  "P": 220,
  "[NH3+]": 221,
  "[O-]": 222,
  "[NH+]": 223,
  "([NH3+])": 224,
  "[S]": 225,
  "([O-])": 226,
  "[n+]": 227,
  "[Na]": 228,
  "[As+]": 229,
  "[Se]": 230,
  "[cH-]": 231,
  "[C+]": 232,
  "[c-]": 233,
  "[Si]": 234,
  "[As]": 235,
  "[S+]": 236,
  "[O]": 237,
  "[K]": 238,
  "[C]": 239,
  "[Fe-4]": 240,
  "[P+]": 241,
  "[CH]": 242,
  "[NH2+]": 243,
  "[N]": 244,
  "[SeH]": 245,
  "[PH]": 246,
  "7": 247,
  "[c+]": 248,
  "[NH-]": 249,
  "([O])": 250,
  "[OH+]": 251,
  "B": 252,
  "[B-]": 253,
  "[SH]": 254,
  "[I+]": 255,
  "[s+]": 256,
  "[Fe-3]": 257,
  "[Se+]": 258,
  "[Fe]": 259,
  "([Na])": 260,
  "8": 261,
  "[nH+]": 262,
  "[SiH2]": 263,
  "[SiH]": 264,
  "([Si])": 265,
  "[se]": 266,
  "Sn": 267,
  "9": 268,
  "%": 269,
  "0": 270,
  "[o+]": 271,
  "[cH+]": 272,
  "[CH2-]": 273,
  "[N-]": 274,
  "[OH2+]": 275,
  "[n-]": 276,
  "[CH-]": 277,
  "([S-])": 278,
  "[C-]": 279,
  "([NH-])": 280,
  "[n]": 281,
  "[SH+]": 282,
  "[C@H]": 283,
  "[C@@H]": 284,
  "[C@@]": 285,
  "/": 286,
  "\\": 287,
  "[C@]": 288,
  "[18F]": 289,
  "([125I])": 290,
  "[N@@+]": 291,
  "[2H]": 292,
  "([2H])": 293,
  "[S@@+]": 294,
  "[BH2-]": 295,
  "[11CH3]": 296,
  "[Te]": 297,
  "[P@@]": 298,
  "[N@@]": 299,
  "[P@]": 300,
  "[S-]": 301,
  "[P@+]": 302,
  "[N@]": 303,
  "[BH-]": 304,
  "[SH2]": 305,
  "[14CH2]": 306,
  "[Cl+]": 307,
  "[S@+]": 308,
  "[N@+]": 309,
  "[I-]": 310,
  "[Ra]": 311,
  "[CH2]": 312,
  "[Cs]": 313,
  "[Zn]": 314,
  "[se+]": 315,
  "[S@]": 316,
  "[3H]": 317,
  "[S@@]": 318,
  "[Ag+]": 319,
  "[F]": 320,
  "[Al-3]": 321,
  "([F])": 322,
  "([3H])": 323,
  "([18F])": 324,
  "([131I])": 325,
  "[13CH]": 326,
  "[11CH]": 327,
  "[11CH2]": 328,
  "[14c]": 329,
  "[14C@@]": 330,
  "([127I])": 331,
  "[11C]": 332,
  "[14C]": 333,
  "([11CH3])": 334,
  "([123I])": 335,
  "[123I]": 336,
  "[124I]": 337,
  "[125I]": 338,
  "[14CH3]": 339,
  "[135I]": 340,
  "([SeH])": 341,
  "[te+]": 342,
  "[127I]": 343,
  "([76Br])": 344,
  "[32PH]": 345,
  "[131I]": 346,
  "[35S]": 347,
  "b": 348,
  "[73Se]": 349,
  "[11C@@H]": 350,
  "[Se-]": 351,
  "[18OH]": 352,
  "[Al]": 353,
  "[P]": 354,
  "[O+]": 355,
  "[Ag]": 356,
  "[te]": 357,
  "[15NH]": 358,
  "[13CH3]": 359,
  "[129Xe]": 360,
  "[TeH]": 361,
  "[Se-2]": 362,
  "[13c]": 363,
  "[13CH2]": 364,
  "[Si-]": 365,
  "[13C]": 366,
  "[18O]": 367,
  "p": 368,
  "([19F])": 369,
  "[Cl+3]": 370,
  "[Br+2]": 371,
  "[I+2]": 372,
  "[I+3]": 373,
  "[OH]": 374,
  "([OH])": 375,
  "[123I-]": 376,
  "[131I-]": 377,
  "[127Xe]": 378,
  "[133Xe]": 379,
  "[89Sr+2]": 380,
  "[82Rb+]": 381,
  "[75Se]": 382,
  "[Rb]": 383,
  "[At]": 384,
  "[81Kr]": 385,
  "([At])": 386,
  "[11c]": 387,
  "[14cH]": 388,
  "[Cl+2]": 389,
  "[211At]": 390,
  "([211At])": 391,
  "[SeH2]": 392,
  "[AsH3]": 393,
  "[Kr]": 394,
  "[Zn+2]": 395,
  "[Xe]": 396,
  "[N@H+]": 397,
  "[AsH]": 398,
  "[10B]": 399,
  "[Si@]": 400,
  "[15n]": 401,
  "[Br-]": 402,
  "[123IH]": 403,
  "[13cH]": 404,
  "[b-]": 405,
  "[SH-]": 406,
  "[NH]": 407,
  "[BH3-]": 408,
  "[14CH]": 409,
  "[15nH]": 410,
  "[Cl]": 411,
  "[223Ra]": 412,
  "[125I-]": 413,
  "[85Sr+2]": 414,
  "[PH2]": 415,
  "[SrH2]": 416,
  "[32P]": 417,
  "[85SrH2]": 418,
  "([14CH3])": 419,
  "[B@@-]": 420,
  "[B@-]": 421,
  "[19F]": 422,
  "[17F]": 423,
  "[PH2+]": 424,
  "[Ba+2]": 425,
  "[P@@+]": 426,
  "([BH3-])": 427,
  "([CH3])": 428,
  "[Ca]": 429,
  "[124I-]": 430,
  "([124I])": 431,
  "([Cl])": 432,
  "[As-]": 433,
  "[Ba]": 434,
  "[82Rb]": 435,
  "[76BrH]": 436,
  "[131Cs]": 437,
  "[125IH]": 438
}