{
  "<s>": 0,
  "</s>": 1,
  "<pad>": 2,
  "<unk>": 3,
  "<mask>": 4,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1] [Branch2]": 5,
  "[C] [S] [=Branch1] [C] [=O] [=Branch1] [C] [=O]": 6,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1] [Branch2]": 7,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Branch1]": 8,
  "[O] [=C] [Branch2] [Ring1] [#Branch1] [N] [C]": 9,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch1] [C]": 10,
  "[O] [=C] [Branch2] [Ring1] [Branch1] [N] [C]": 11,
  "[C] [C] [Branch1] [C] [C] [Branch1] [C] [C]": 12,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring1]": 13,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring2]": 14,
  "[C] [C] [Branch1] [C] [C] [C@H1] [Branch2]": 15,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C] [C]": 16,
  "[O] [=C] [Branch1] [Ring2] [O] [C] [C] [C]": 17,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [N] [C]": 18,
  "[O] [=C] [Branch2] [Ring1] [Ring2] [N] [C]": 19,
  "[C] [C] [N] [Branch1] [Ring1] [C] [C] [C]": 20,
  "[O] [=C] [Branch1] [#Branch2] [N] [C] [C]": 21,
  "[C] [=C] [C] [=Branch1] [C] [=O] [N] [C]": 22,
  "[C] [N] [C] [=Branch1] [C] [=O] [C] [=C]": 23,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [=C]": 24,
  "[N] [#C] [C] [=C] [C] [=C] [C] [Branch2]": 25,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch2]": 26,
  "[C] [C] [=Branch1] [C] [=O] [N] [C] [C]": 27,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring1]": 28,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring2]": 29,
  "[C] [C] [=C] [C] [Branch1] [C] [C] [=C]": 30,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1]": 31,
  "[C] [C] [C] [=Branch1] [C] [=O] [N] [C]": 32,
  "[C] [C] [O] [C] [=Branch1] [C] [=O] [C]": 33,
  "[C] [C] [O] [C] [=C] [C] [=C] [Branch2]": 34,
  "[C] [O] [C] [=Branch1] [C] [=O] [C@@H1]": 35,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [C]": 36,
  "[C] [O] [C] [=Branch1] [C] [=O] [N] [C]": 37,
  "[C] [O] [C] [=C] [C] [=C] [Branch1] [C]": 38,
  "[C] [O] [C] [=C] [C] [=C] [C] [Branch2]": 39,
  "[O] [=C] [Branch1] [C] [O] [C] [=C] [C]": 40,
  "[C] [C] [Branch1] [C] [C] [=C] [C] [C]": 41,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring1]": 42,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring2]": 43,
  "[O] [=C] [Branch1] [C] [O] [C] [C] [C]": 44,
  "[O] [=C] [Branch1] [C] [O] [C] [O] [C]": 45,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C]": 46,
  "[O] [=C] [Branch2] [Ring1] [C] [N] [C]": 47,
  "[O] [=C] [Branch2] [Ring1] [N] [N] [C]": 48,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [C]": 49,
  "[O] [=S] [=Branch1] [C] [=O] [Branch1]": 50,
  "[O] [=S] [=Branch1] [C] [=O] [Branch2]": 51,
  "[C] [C] [Branch1] [C] [C] [C] [C@@H1]": 52,
  "[C] [N] [Branch1] [C] [C] [C] [C] [C]": 53,
  "[O] [=C] [Branch1] [#Branch1] [N] [C]": 54,
  "[O] [=C] [Branch1] [#Branch2] [N] [C]": 55,
  "[O] [=C] [Branch2] [Ring1] [#Branch1]": 56,
  "[O] [=C] [Branch2] [Ring1] [#Branch2]": 57,
  "[O] [=C] [Branch2] [Ring1] [=Branch1]": 58,
  "[O] [=C] [Branch2] [Ring1] [=Branch2]": 59,
  "[O] [=C] [Branch2] [Ring2] [#Branch1]": 60,
  "[O] [=C] [Branch2] [Ring2] [#Branch2]": 61,
  "[O] [=C] [Branch2] [Ring2] [=Branch1]": 62,
  "[O] [=C] [Branch2] [Ring2] [=Branch2]": 63,
  "[C] [=C] [C] [=Branch1] [C] [=O] [O]": 64,
  "[C] [C] [=Branch1] [C] [=O] [C] [=C]": 65,
  "[C] [C] [=C] [C] [=Branch1] [C] [=O]": 66,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1]": 67,
  "[N] [#C] [C] [=C] [C] [=C] [Branch2]": 68,
  "[O] [=C] [Branch2] [Ring1] [Branch1]": 69,
  "[O] [=C] [Branch2] [Ring1] [Branch2]": 70,
  "[O] [=C] [Branch2] [Ring2] [Branch1]": 71,
  "[O] [=C] [Branch2] [Ring2] [Branch2]": 72,
  "[C] [C] [=Branch1] [C] [=O] [N] [C]": 73,
  "[C] [C] [=Branch1] [C] [=O] [O] [C]": 74,
  "[C] [C] [=C] [C] [=C] [Branch1] [C]": 75,
  "[C] [C] [=C] [C] [=C] [C] [Branch2]": 76,
  "[C] [C] [Branch1] [C] [C] [Branch2]": 77,
  "[C] [C] [C] [=C] [C] [=C] [Branch2]": 78,
  "[C] [C] [C] [C] [=Branch1] [C] [=O]": 79,
  "[C] [C] [N] [C] [=Branch1] [C] [=O]": 80,
  "[C] [C] [O] [C] [=Branch1] [C] [=O]": 81,
  "[C] [N] [C] [=Branch1] [C] [=O] [C]": 82,
  "[C] [N] [C] [=Branch1] [C] [=O] [N]": 83,
  "[C] [O] [C] [=Branch1] [C] [=O] [C]": 84,
  "[C] [O] [C] [=Branch1] [C] [=O] [N]": 85,
  "[C] [O] [C] [=C] [C] [=C] [Branch1]": 86,
  "[C] [O] [C] [=C] [C] [=C] [Branch2]": 87,
  "[O] [=C] [Branch1] [#C] [N] [C] [C]": 88,
  "[O] [=C] [Branch1] [C] [O] [C] [=C]": 89,
  "[O] [=C] [O] [C] [=C] [C] [Branch1]": 90,
  "[C] [O] [C] [=C] [C] [=C] [C] [=C]": 91,
  "[C] [O] [C] [=C] [C] [=C] [N] [=C]": 92,
  "[C] [O] [C] [=C] [C] [Branch1] [C]": 93,
  "[O] [=C] [Branch1] [C] [O] [C] [C]": 94,
  "[O] [=C] [Branch1] [N] [N] [C] [C]": 95,
  "[O] [=C] [Branch1] [O] [N] [C] [C]": 96,
  "[O] [=C] [Branch2] [Ring1] [C] [C]": 97,
  "[O] [=C] [Branch2] [Ring1] [Ring1]": 98,
  "[O] [=C] [Branch2] [Ring1] [Ring2]": 99,
  "[O] [=C] [Branch2] [Ring2] [Ring1]": 100,
  "[O] [=C] [Branch2] [Ring2] [Ring2]": 101,
  "[O] [=C] [C] [C] [Branch1] [C] [O]": 102,
  "[O] [=C] [O] [C] [=C] [C] [=C] [C]": 103,
  "[C] [C] [Branch1] [C] [C] [C@@H1]": 104,
  "[C] [C] [Branch1] [C] [C] [C] [C]": 105,
  "[C] [C] [Branch1] [C] [C] [C] [N]": 106,
  "[C] [C] [Branch1] [C] [C] [N] [C]": 107,
  "[C] [C] [Branch1] [C] [C] [O] [C]": 108,
  "[C] [C] [C] [O] [C] [=C] [C] [=C]": 109,
  "[C] [C] [N] [C] [C] [N] [Branch2]": 110,
  "[C] [C] [O] [C] [=C] [C] [=C] [C]": 111,
  "[C] [N] [Branch1] [C] [C] [C] [C]": 112,
  "[O] [=C] [Branch1] [=Branch2] [C]": 113,
  "[C] [=C] [C] [=Branch1] [C] [=O]": 114,
  "[C] [C] [Branch1] [C] [C] [C@H1]": 115,
  "[C] [C] [C@H1] [Branch1] [C] [C]": 116,
  "[Cl] [C] [=C] [C] [=C] [Branch2]": 117,
  "[O] [=C] [C] [=Branch1] [C] [=O]": 118,
  "[O] [=C] [C] [=C] [C] [=Branch2]": 119,
  "[C] [C] [=Branch1] [C] [=O] [N]": 120,
  "[C] [C] [=Branch1] [C] [=O] [O]": 121,
  "[C] [C] [=C] [C] [=C] [Branch1]": 122,
  "[C] [C] [=C] [C] [=C] [Branch2]": 123,
  "[C] [C] [C] [=Branch1] [C] [=O]": 124,
  "[C] [C] [C] [C] [C] [C] [C] [C]": 125,
  "[C] [N] [C] [=Branch1] [C] [=O]": 126,
  "[C] [O] [C] [=Branch1] [C] [=O]": 127,
  "[F] [C] [=C] [C] [=C] [Branch2]": 128,
  "[N] [C] [=Branch1] [C] [=O] [C]": 129,
  "[O] [=C] [Branch1] [#C] [N] [C]": 130,
  "[O] [=C] [Branch1] [=C] [N] [C]": 131,
  "[O] [=C] [Branch1] [=N] [N] [C]": 132,
  "[O] [=C] [Branch2] [Ring1] [#C]": 133,
  "[O] [=C] [Branch2] [Ring1] [=C]": 134,
  "[O] [=C] [Branch2] [Ring1] [=N]": 135,
  "[O] [=C] [Branch2] [Ring2] [=N]": 136,
  "[O] [=C] [C] [=C] [C] [Branch1]": 137,
  "[O] [=C] [C] [=C] [C] [Branch2]": 138,
  "[O] [=C] [O] [C] [=C] [Branch2]": 139,
  "[O] [C] [=C] [C] [=C] [Branch1]": 140,
  "[O] [C] [=C] [C] [=C] [Branch2]": 141,
  "[C] [C] [=C] [C] [Branch1] [C]": 142,
  "[C] [O] [C] [=C] [Branch1] [C]": 143,
  "[C] [O] [C] [=C] [C] [Branch1]": 144,
  "[C] [O] [C] [=C] [C] [Branch2]": 145,
  "[N] [#C] [C] [=C] [C] [=C] [C]": 146,
  "[O] [=C] [Branch1] [C] [N] [C]": 147,
  "[O] [=C] [Branch1] [C] [O] [C]": 148,
  "[O] [=C] [Branch1] [P] [N] [C]": 149,
  "[O] [=C] [Branch1] [S] [N] [C]": 150,
  "[O] [=C] [Branch2] [Ring1] [C]": 151,
  "[O] [=C] [Branch2] [Ring1] [N]": 152,
  "[O] [=C] [Branch2] [Ring1] [O]": 153,
  "[O] [=C] [Branch2] [Ring1] [P]": 154,
  "[O] [=C] [Branch2] [Ring1] [S]": 155,
  "[O] [=C] [Branch2] [Ring2] [C]": 156,
  "[O] [=C] [Branch2] [Ring2] [N]": 157,
  "[O] [=C] [Branch2] [Ring2] [O]": 158,
  "[O] [=C] [C] [C] [=C] [C] [=C]": 159,
  "[O] [=C] [N] [C] [=C] [C] [=C]": 160,
  "[O] [=C] [O] [C] [=C] [C] [=C]": 161,
  "[O] [=C] [O] [C] [Branch1] [C]": 162,
  "[O] [=C] [O] [C] [C] [Branch1]": 163,
  "[C] [C] [Branch1] [C] [C] [C]": 164,
  "[C] [C] [Branch1] [C] [C] [N]": 165,
  "[C] [C] [C] [=C] [C] [=C] [C]": 166,
  "[C] [C] [C] [Branch1] [C] [C]": 167,
  "[C] [C] [C] [C] [=C] [C] [=C]": 168,
  "[C] [C] [C] [C] [N] [Branch2]": 169,
  "[C] [C] [O] [C] [=C] [C] [=C]": 170,
  "[C] [N] [Branch1] [C] [C] [C]": 171,
  "[C] [N] [C] [C] [C] [Branch2]": 172,
  "[C] [N] [C] [C] [N] [Branch2]": 173,
  "[C] [O] [C] [=C] [C] [=C] [C]": 174,
  "[C] [O] [C] [=C] [C] [=N] [C]": 175,
  "[O] [=C] [Branch1] [#Branch1]": 176,
  "[O] [=C] [Branch1] [#Branch2]": 177,
  "[O] [=C] [Branch1] [=Branch2]": 178,
  "[O] [=C] [Branch2] [=Branch1]": 179,
  "[O] [=C] [C] [C] [C] [=C] [C]": 180,
  "[O] [C] [C] [O] [C] [Branch2]": 181,
  "[C] [C] [C] [C] [C] [=N] [C]": 182,
  "[O] [=C] [Branch1] [Branch2]": 183,
  "[O] [=C] [Branch2] [Branch1]": 184,
  "[O] [=S] [=Branch1] [C] [=O]": 185,
  "[C] [=C] [C] [=C] [Branch2]": 186,
  "[C] [C] [=Branch1] [C] [=O]": 187,
  "[N] [C] [=Branch1] [C] [=O]": 188,
  "[O] [=C] [Branch1] [#C] [C]": 189,
  "[O] [=C] [Branch1] [=C] [C]": 190,
  "[O] [=C] [Branch1] [=N] [C]": 191,
  "[O] [=C] [C] [=C] [Branch1]": 192,
  "[O] [=C] [C] [=C] [Branch2]": 193,
  "[C] [=C] [Branch1] [C] [C]": 194,
  "[C] [C] [=C] [Branch1] [C]": 195,
  "[C] [C] [=C] [C] [Branch1]": 196,
  "[C] [C] [=C] [C] [Branch2]": 197,
  "[C] [C] [=C] [N] [Branch2]": 198,
  "[C] [C] [=N] [C] [Branch2]": 199,
  "[C] [C] [=N] [N] [Branch1]": 200,
  "[C] [C] [C] [=C] [Branch2]": 201,
  "[C] [N] [C] [=C] [Branch2]": 202,
  "[Cl] [C] [=C] [C] [=C] [C]": 203,
  "[N] [#C] [C] [=C] [C] [=C]": 204,
  "[N] [=C] [Branch1] [C] [N]": 205,
  "[O] [=C] [Branch1] [O] [C]": 206,
  "[O] [=C] [Branch1] [P] [C]": 207,
  "[O] [=C] [Branch1] [Ring1]": 208,
  "[O] [=C] [Branch1] [S] [C]": 209,
  "[O] [=C] [Branch2] [Ring2]": 210,
  "[O] [=C] [C] [=C] [C] [=C]": 211,
  "[O] [=C] [C] [Branch1] [C]": 212,
  "[O] [=C] [O] [C] [Branch1]": 213,
  "[O] [=C] [O] [C] [Branch2]": 214,
  "[C] [C] [=C] [C] [=C] [C]": 215,
  "[C] [C] [Branch1] [C] [C]": 216,
  "[C] [C] [C] [=C] [C] [=C]": 217,
  "[C] [N] [C] [=C] [C] [=C]": 218,
  "[C] [O] [C] [=C] [C] [=C]": 219,
  "[C] [O] [C] [=N] [C] [=C]": 220,
  "[C] [S] [C] [=C] [C] [=C]": 221,
  "[F] [C] [=C] [C] [=C] [C]": 222,
  "[N] [C] [=C] [C] [=C] [C]": 223,
  "[O] [=C] [O] [C] [=C] [C]": 224,
  "[O] [=C] [O] [C] [C] [=C]": 225,
  "[O] [C] [=C] [C] [=C] [C]": 226,
  "[O] [C] [C] [Branch1] [C]": 227,
  "[C] [C@H1] [Branch1] [C]": 228,
  "[C] [C] [O] [C] [=C] [C]": 229,
  "[O] [=C] [C] [C] [C] [C]": 230,
  "[O] [=C] [O] [C] [C] [C]": 231,
  "[C] [C] [C] [C] [C] [C]": 232,
  "[C] [C] [C] [C] [N] [C]": 233,
  "[C] [C] [C] [C] [O] [C]": 234,
  "[C] [O] [C] [C] [N] [C]": 235,
  "[C] [O] [C] [C] [O] [C]": 236,
  "[O] [=C] [Branch1] [#C]": 237,
  "[O] [=C] [Branch1] [=C]": 238,
  "[O] [=C] [Branch1] [=N]": 239,
  "[O] [=C] [C] [=Branch2]": 240,
  "[Br] [C] [=C] [C] [=C]": 241,
  "[C] [C] [=C] [Branch1]": 242,
  "[C] [C] [=C] [Branch2]": 243,
  "[C] [C] [C] [C] [C@H1]": 244,
  "[Cl] [C] [=C] [C] [=C]": 245,
  "[O] [=C] [Branch1] [N]": 246,
  "[O] [=C] [Branch1] [O]": 247,
  "[O] [=C] [Branch1] [P]": 248,
  "[O] [=C] [Branch1] [S]": 249,
  "[O] [=C] [C] [Branch1]": 250,
  "[O] [=C] [C] [Branch2]": 251,
  "[O] [=C] [N] [Branch2]": 252,
  "[C] [=C] [C] [=C] [C]": 253,
  "[C] [C@@H1] [Branch2]": 254,
  "[C] [C] [=C] [C] [=C]": 255,
  "[C] [C] [=C] [N] [=C]": 256,
  "[C] [C] [=N] [C] [=C]": 257,
  "[C] [C] [C] [Branch1]": 258,
  "[C] [C] [N] [Branch2]": 259,
  "[F] [C] [=C] [C] [=C]": 260,
  "[N] [C] [=C] [C] [=C]": 261,
  "[N] [C] [=N] [C] [=C]": 262,
  "[O] [=C] [C] [=C] [C]": 263,
  "[O] [=C] [O] [C] [=C]": 264,
  "[O] [C] [=C] [C] [=C]": 265,
  "[C] [=C] [C] [N] [C]": 266,
  "[C] [C@H1] [Branch1]": 267,
  "[C] [C@H1] [Branch2]": 268,
  "[C] [C] [=N] [O] [C]": 269,
  "[C] [C] [C] [=C] [C]": 270,
  "[C] [C] [C] [=N] [C]": 271,
  "[C] [C] [C] [C] [=C]": 272,
  "[C] [C] [C] [C] [=N]": 273,
  "[C] [C] [N] [C] [=C]": 274,
  "[C] [C] [N] [N] [=C]": 275,
  "[C] [N] [C] [=C] [C]": 276,
  "[C] [N] [C] [=N] [C]": 277,
  "[C] [O] [C] [=C] [C]": 278,
  "[C] [O] [C] [=N] [C]": 279,
  "[C] [S] [C] [=N] [C]": 280,
  "[O] [=C] [C] [C] [C]": 281,
  "[O] [=C] [N] [C] [C]": 282,
  "[O] [=C] [O] [C] [C]": 283,
  "[O] [C] [C] [=C] [C]": 284,
  "[C] [C@@H1] [C] [N]": 285,
  "[C] [C] [C] [C] [C]": 286,
  "[C] [C] [C] [C] [N]": 287,
  "[C] [C] [C] [N] [C]": 288,
  "[C] [C] [C] [O] [C]": 289,
  "[C] [C] [N] [C] [C]": 290,
  "[C] [N] [C] [C] [C]": 291,
  "[C] [O] [C] [C] [C]": 292,
  "[N] [C] [C] [C] [C]": 293,
  "[O] [C] [C] [C] [C]": 294,
  "[O] [=C] [Branch1]": 295,
  "[O] [=C] [Branch2]": 296,
  "[O] [=C] [NH1] [C]": 297,
  "[C] [=C] [C] [=C]": 298,
  "[C] [C] [Branch2]": 299,
  "[C] [N] [Branch1]": 300,
  "[C] [N] [Branch2]": 301,
  "[N] [#C] [C] [=C]": 302,
  "[O] [=C] [C] [=C]": 303,
  "[O] [C] [Branch1]": 304,
  "[C] [=C] [C] [C]": 305,
  "[C] [C@] [C] [C]": 306,
  "[C] [C] [=C] [C]": 307,
  "[C] [C] [=C] [N]": 308,
  "[C] [C] [=N] [C]": 309,
  "[C] [C] [=N] [N]": 310,
  "[C] [C] [C] [=C]": 311,
  "[C] [C] [C] [=N]": 312,
  "[C] [C] [N] [=C]": 313,
  "[C] [N] [C] [=C]": 314,
  "[C] [N] [N] [=C]": 315,
  "[C] [S] [C] [=N]": 316,
  "[N] [#C] [C] [C]": 317,
  "[N] [C] [=N] [C]": 318,
  "[O] [=C] [C] [C]": 319,
  "[O] [=C] [N] [C]": 320,
  "[O] [=C] [O] [C]": 321,
  "[O] [C] [C] [=C]": 322,
  "[C] [C@@H1] [C]": 323,
  "[C] [C] [C@@H1]": 324,
  "[C] [C] [C] [C]": 325,
  "[C] [C] [C] [N]": 326,
  "[C] [C] [C] [S]": 327,
  "[C] [C] [N] [C]": 328,
  "[C] [C] [O] [C]": 329,
  "[C] [C] [S] [C]": 330,
  "[C] [N] [C] [C]": 331,
  "[C] [O] [C] [C]": 332,
  "[N] [C] [C] [C]": 333,
  "[O] [C] [C] [C]": 334,
  "[C] [C@H1] [C]": 335,
  "[C] [C] [C@H1]": 336,
  "[Cl] .[O] [=C]": 337,
  "[C] [/C] [=C]": 338,
  "[O] [Branch2]": 339,
  "[C] [#C] [C]": 340,
  "[C] [=C] [C]": 341,
  "[C] [C] [=C]": 342,
  "[C] [C] [=N]": 343,
  "[N] [#C] [C]": 344,
  "[O] [=C] [C]": 345,
  "[O] [=C] [N]": 346,
  "[C] [C@@H1]": 347,
  "[C] [C] [C]": 348,
  "[C] [C] [N]": 349,
  "[C] [C] [S]": 350,
  "[C] [N] [C]": 351,
  "[C] [O] [C]": 352,
  "[C] [S] [C]": 353,
  "[N] [C@@H1]": 354,
  "[N] [C] [C]": 355,
  "[O] [C] [C]": 356,
  "[#Branch1]": 357,
  "[#Branch2]": 358,
  "[=Branch1]": 359,
  "[=Branch2]": 360,
  "[=Branch3]": 361,
  "[C] [C@H1]": 362,
  ".[125IH1]": 363,
  ".[68Ga+3]": 364,
  ".[85Sr+2]": 365,
  ".[SiH3-1]": 366,
  "[-/Ring1]": 367,
  "[-/Ring2]": 368,
  "[-\\Ring1]": 369,
  "[-\\Ring2]": 370,
  "[/-Ring1]": 371,
  "[/-Ring2]": 372,
  "[11C@@H1]": 373,
  "[Branch1]": 374,
  "[Branch2]": 375,
  "[Branch3]": 376,
  "[C] [C@@]": 377,
  "[C] [N+1]": 378,
  "[Cl] .[N]": 379,
  "[Cl] .[O]": 380,
  "[\\-Ring1]": 381,
  "[\\-Ring2]": 382,
  ".[18F-1]": 383,
  ".[NH1-1]": 384,
  ".[NH2+1]": 385,
  ".[NH3+1]": 386,
  ".[NH4+1]": 387,
  ".[OH1-1]": 388,
  ".[OH3+1]": 389,
  ".[SH1-1]": 390,
  "[#Ring2]": 391,
  "[/13CH1]": 392,
  "[/C@@H1]": 393,
  "[123I-1]": 394,
  "[123IH1]": 395,
  "[124I-1]": 396,
  "[125I-1]": 397,
  "[125IH1]": 398,
  "[131I-1]": 399,
  "[14C@H1]": 400,
  "[22Na+1]": 401,
  "[45Ca+2]": 402,
  "[47Ca+2]": 403,
  "[76BrH1]": 404,
  "[82Rb+1]": 405,
  "[85Sr+2]": 406,
  "[85SrH2]": 407,
  "[89Sr+2]": 408,
  "[=13CH1]": 409,
  "[=14CH1]": 410,
  "[=32PH1]": 411,
  "[=CH1-1]": 412,
  "[=NH1+1]": 413,
  "[=NH2+1]": 414,
  "[=OH1+1]": 415,
  "[=Ring1]": 416,
  "[=Ring2]": 417,
  "[=Ring3]": 418,
  "[Br] [C]": 419,
  "[C] [/C]": 420,
  "[C] [=C]": 421,
  "[C] [C@]": 422,
  "[FeH2-2]": 423,
  "[N@H1+1]": 424,
  "[N] [=C]": 425,
  "[O] [=C]": 426,
  "[SiH1-1]": 427,
  "[\\11CH3]": 428,
  "[\\C@@H1]": 429,
  "[\\CH1-1]": 430,
  "[\\NH1-1]": 431,
  ".[Ag+1]": 432,
  ".[Al+3]": 433,
  ".[Ba+2]": 434,
  ".[Be+2]": 435,
  ".[Bi+3]": 436,
  ".[Br-1]": 437,
  ".[Ca+2]": 438,
  ".[CaH2]": 439,
  ".[Cl-1]": 440,
  ".[Cs+1]": 441,
  ".[Li+1]": 442,
  ".[LiH1]": 443,
  ".[Mg+2]": 444,
  ".[MgH2]": 445,
  ".[Na+1]": 446,
  ".[NaH1]": 447,
  ".[Rb+1]": 448,
  ".[Se-2]": 449,
  ".[SiH4]": 450,
  ".[Sr+2]": 451,
  ".[TeH2]": 452,
  ".[Zn+1]": 453,
  ".[Zn+2]": 454,
  "[/123I]": 455,
  "[/125I]": 456,
  "[/131I]": 457,
  "[/C@H1]": 458,
  "[/SeH1]": 459,
  "[11C-1]": 460,
  "[11CH1]": 461,
  "[11CH2]": 462,
  "[11CH3]": 463,
  "[123Te]": 464,
  "[127Xe]": 465,
  "[129Xe]": 466,
  "[131Cs]": 467,
  "[133Xe]": 468,
  "[13CH1]": 469,
  "[13CH2]": 470,
  "[13CH3]": 471,
  "[13NH3]": 472,
  "[14C@@]": 473,
  "[14CH1]": 474,
  "[14CH2]": 475,
  "[14CH3]": 476,
  "[15NH1]": 477,
  "[15OH2]": 478,
  "[18F-1]": 479,
  "[18FH1]": 480,
  "[18OH1]": 481,
  "[211At]": 482,
  "[223Ra]": 483,
  "[42K+1]": 484,
  "[=Se+1]": 485,
  "[=SeH1]": 486,
  "[=Te+1]": 487,
  "[B@@-1]": 488,
  "[BH1-1]": 489,
  "[BH2-1]": 490,
  "[BH3-1]": 491,
  "[C@@H1]": 492,
  "[CH1+1]": 493,
  "[CH1-1]": 494,
  "[CH2-1]": 495,
  "[C] [C]": 496,
  "[C] [N]": 497,
  "[C] [S]": 498,
  "[F] [C]": 499,
  "[N@@+1]": 500,
  "[NH1+1]": 501,
  "[NH1-1]": 502,
  "[NH2+1]": 503,
  "[NH2+2]": 504,
  "[NH3+1]": 505,
  "[N] [C]": 506,
  "[N] [N]": 507,
  "[OH1+1]": 508,
  "[OH2+1]": 509,
  "[O] [C]": 510,
  "[P@@+1]": 511,
  "[PH2+1]": 512,
  "[Ring1]": 513,
  "[Ring2]": 514,
  "[Ring3]": 515,
  "[S@@+1]": 516,
  "[SH1+1]": 517,
  "[SH1-1]": 518,
  "[\\123I]": 519,
  "[\\125I]": 520,
  "[\\C@H1]": 521,
  "[\\SeH1]": 522,
  ".[BH0]": 523,
  ".[C-1]": 524,
  ".[F-1]": 525,
  ".[H+1]": 526,
  ".[H-1]": 527,
  ".[HH1]": 528,
  ".[I-1]": 529,
  ".[K+1]": 530,
  ".[KH1]": 531,
  ".[N-1]": 532,
  ".[O-1]": 533,
  ".[O-2]": 534,
  ".[S-1]": 535,
  ".[S-2]": 536,
  "[#11C]": 537,
  "[#14C]": 538,
  "[#C-1]": 539,
  "[#N+1]": 540,
  "[#O+1]": 541,
  "[/13C]": 542,
  "[/14C]": 543,
  "[/C-1]": 544,
  "[/C@@]": 545,
  "[/N+1]": 546,
  "[/N-1]": 547,
  "[/NH1]": 548,
  "[/O-1]": 549,
  "[/P+1]": 550,
  "[/P@@]": 551,
  "[/PH1]": 552,
  "[/S+1]": 553,
  "[/S-1]": 554,
  "[/S@@]": 555,
  "[123I]": 556,
  "[124I]": 557,
  "[125I]": 558,
  "[127I]": 559,
  "[131I]": 560,
  "[135I]": 561,
  "[73Se]": 562,
  "[75Se]": 563,
  "[76Br]": 564,
  "[81Kr]": 565,
  "[82Rb]": 566,
  "[=11C]": 567,
  "[=13C]": 568,
  "[=14C]": 569,
  "[=18O]": 570,
  "[=32P]": 571,
  "[=B-1]": 572,
  "[=N+1]": 573,
  "[=N-1]": 574,
  "[=O+1]": 575,
  "[=P@@]": 576,
  "[=PH1]": 577,
  "[=PH2]": 578,
  "[=S+1]": 579,
  "[=S-1]": 580,
  "[=S@@]": 581,
  "[=SH0]": 582,
  "[=SH1]": 583,
  "[Ag+1]": 584,
  "[Al-3]": 585,
  "[As+1]": 586,
  "[As-1]": 587,
  "[AsH1]": 588,
  "[AsH3]": 589,
  "[B@-1]": 590,
  "[Ba+2]": 591,
  "[Br+2]": 592,
  "[Br-1]": 593,
  "[C@H1]": 594,
  "[Ca+2]": 595,
  "[Cl+1]": 596,
  "[Cl+2]": 597,
  "[Cl+3]": 598,
  "[Cl-1]": 599,
  "[Fe+1]": 600,
  "[Fe+2]": 601,
  "[Fe+3]": 602,
  "[Fe-3]": 603,
  "[Fe-4]": 604,
  "[Li+1]": 605,
  "[LiH1]": 606,
  "[Mg+1]": 607,
  "[Mg+2]": 608,
  "[MgH2]": 609,
  "[N@+1]": 610,
  "[Na+1]": 611,
  "[P@+1]": 612,
  "[S@+1]": 613,
  "[Se+1]": 614,
  "[Se-1]": 615,
  "[Se-2]": 616,
  "[SeH1]": 617,
  "[SeH2]": 618,
  "[Si-1]": 619,
  "[SiH1]": 620,
  "[SiH2]": 621,
  "[SrH2]": 622,
  "[Te-1]": 623,
  "[TeH1]": 624,
  "[Zn+2]": 625,
  "[Zn-2]": 626,
  "[\\C-1]": 627,
  "[\\C@@]": 628,
  "[\\N+1]": 629,
  "[\\N-1]": 630,
  "[\\NH1]": 631,
  "[\\O-1]": 632,
  "[\\PH1]": 633,
  "[\\S+1]": 634,
  "[\\S-1]": 635,
  ".[2H]": 636,
  ".[3H]": 637,
  ".[Ag]": 638,
  ".[As]": 639,
  ".[Bi]": 640,
  ".[Br]": 641,
  ".[Cl]": 642,
  ".[Li]": 643,
  ".[Zn]": 644,
  "[/As]": 645,
  "[/Br]": 646,
  "[/C@]": 647,
  "[/Cl]": 648,
  "[/S@]": 649,
  "[/Se]": 650,
  "[/Si]": 651,
  "[10B]": 652,
  "[11C]": 653,
  "[13C]": 654,
  "[14C]": 655,
  "[15N]": 656,
  "[17F]": 657,
  "[18F]": 658,
  "[19F]": 659,
  "[32P]": 660,
  "[35S]": 661,
  "[=Al]": 662,
  "[=As]": 663,
  "[=Fe]": 664,
  "[=Mg]": 665,
  "[=P@]": 666,
  "[=S@]": 667,
  "[=Se]": 668,
  "[=Si]": 669,
  "[=Te]": 670,
  "[B-1]": 671,
  "[BH0]": 672,
  "[C+1]": 673,
  "[C-1]": 674,
  "[C@@]": 675,
  "[CH0]": 676,
  "[CH1]": 677,
  "[F-1]": 678,
  "[I+1]": 679,
  "[I+2]": 680,
  "[I+3]": 681,
  "[I-1]": 682,
  "[K+1]": 683,
  "[N+1]": 684,
  "[N+3]": 685,
  "[N-1]": 686,
  "[N@@]": 687,
  "[NH0]": 688,
  "[NH1]": 689,
  "[O+1]": 690,
  "[O-1]": 691,
  "[O-2]": 692,
  "[OH0]": 693,
  "[OH1]": 694,
  "[P+1]": 695,
  "[P@@]": 696,
  "[PH1]": 697,
  "[S+1]": 698,
  "[S-1]": 699,
  "[S@@]": 700,
  "[SH0]": 701,
  "[SH1]": 702,
  "[SH2]": 703,
  "[Si@]": 704,
  "[\\3H]": 705,
  "[\\Br]": 706,
  "[\\C@]": 707,
  "[\\Cl]": 708,
  "[\\Se]": 709,
  "[\\Si]": 710,
  ".[B]": 711,
  ".[C]": 712,
  ".[F]": 713,
  ".[I]": 714,
  ".[K]": 715,
  ".[N]": 716,
  ".[O]": 717,
  ".[S]": 718,
  "[#C]": 719,
  "[#N]": 720,
  "[#P]": 721,
  "[#S]": 722,
  "[/B]": 723,
  "[/C]": 724,
  "[/F]": 725,
  "[/I]": 726,
  "[/N]": 727,
  "[/O]": 728,
  "[/P]": 729,
  "[/S]": 730,
  "[2H]": 731,
  "[3H]": 732,
  "[=B]": 733,
  "[=C]": 734,
  "[=N]": 735,
  "[=O]": 736,
  "[=P]": 737,
  "[=S]": 738,
  "[Ag]": 739,
  "[Al]": 740,
  "[As]": 741,
  "[At]": 742,
  "[Ba]": 743,
  "[Br]": 744,
  "[C@]": 745,
  "[Ca]": 746,
  "[Cl]": 747,
  "[Cs]": 748,
  "[Fe]": 749,
  "[He]": 750,
  "[Kr]": 751,
  "[Mg]": 752,
  "[N@]": 753,
  "[Na]": 754,
  "[P@]": 755,
  "[Ra]": 756,
  "[Rb]": 757,
  "[S@]": 758,
  "[Se]": 759,
  "[Si]": 760,
  "[Te]": 761,
  "[Xe]": 762,
  "[Zn]": 763,
  "[\\B]": 764,
  "[\\C]": 765,
  "[\\F]": 766,
  "[\\I]": 767,
  "[\\N]": 768,
  "[\\O]": 769,
  "[\\P]": 770,
  "[\\S]": 771,
  "[B]": 772,
  "[C]": 773,
  "[F]": 774,
  "[H]": 775,
  "[I]": 776,
  "[K]": 777,
  "[N]": 778,
  "[O]": 779,
  "[P]": 780,
  "[S]": 781,
  ".": 782,
  "0": 783,
  "1": 784,
  "2": 785,
  "3": 786,
  "4": 787,
  "5": 788,
  "6": 789,
  "7": 790,
  "8": 791,
  "9": 792
}